app/controllers/items_controller.rb

  def index
    @items = Item.all

    offset = rand(Item.count)
    @rand_record = Item.offset(offset).first.id
---
SELECT COUNT(*) FROM "items"
SELECT  "items".* FROM "items"   ORDER BY "items"."id" ASC LIMIT 1 OFFSET 18701

  def create_history

    user = current_user

    new_history = History.new
    new_history.user_id = user.id
    new_history.item_id = params['item_id']
    new_history.liked = if params['liked'] == 'true'
                          true
                        else
                          false
                        end
    new_history.in_wishlist = if params['liked'] == 'true'
                          true
                        else
                          false
                        end
    new_history.clicked_through = params['clicked_through']
    new_history.save
---
INSERT INTO "histories" ("clicked_through", "created_at", "in_wishlist", "item_id", "liked", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def top_category
    @gender_old = params[:gender]

    @gender = convert_top_level_name(@gender_old)

    id = Category.where(name: @gender).first.id

    @children = Category.find(id).children
---
SELECT  "categories".* FROM "categories"  WHERE "categories"."name" = 'male'  ORDER BY "categories"."id" ASC LIMIT 1
SELECT  "categories".* FROM "categories"  WHERE "categories"."id" = $1 LIMIT 1

  def category_all
    @user = current_user

    @category = params[:category]
    @gender = params[:gender]
    @color = params[:color]

    case @category || @gender
      when 'womens'
        @category == 'womens'
        @items = Item.where('gender=? OR gender=?', 'female', 'unisex')
        @item = @items.sample
      when 'mens'
        @items = Item.where('gender=? OR gender=?', 'male', 'unisex')
---
SELECT "items".* FROM "items"  WHERE (gender='male' OR gender='unisex')

  def next_item
  # Determines what will be shown next

    # if a first-time user (no history yet)
    if @user.histories.count < 20

        if @color == nil
          @next_item = @items.sample
        else #there's a color params (whether "" or color)
            if @color == ""
              @next_item = @items.sample
            else
              @next_item = @items.where(:color => params['color']).sample
            end
      end


    # if user has history record
    else

      liked_items = @user.histories.where(:liked => true)
---
SELECT COUNT(*) FROM "histories"  WHERE "histories"."user_id" = $1
SELECT "histories".* FROM "histories"  WHERE "histories"."user_id" = $1 AND "histories"."liked" = 't'